Tekla.Structures.Drawing.ReinforcementPulloutElement.EndSymbols
The shape of the bar ends in the pull-out.

Tekla.Structures.Drawing.ReinforcementPulloutElement.EndSymbols.NONE
No end symbols.

Tekla.Structures.Drawing.ReinforcementPulloutElement.EndSymbols.None
No end symbols.

Tekla.Structures.Drawing.ReinforcementPulloutElement.EndSymbols.SINGLE
A single end symbol arrow.

Tekla.Structures.Drawing.ReinforcementPulloutElement.EndSymbols.Single
A single end symbol arrow.

Tekla.Structures.Drawing.ReinforcementPulloutElement.EndSymbols.BOTH
An arrow to both directions.

Tekla.Structures.Drawing.ReinforcementPulloutElement.EndSymbols.Both
An arrow to both directions.